# Python core
ms-python.python
ms-python.vscode-pylance
ms-python.debugpy
ms-python.black-formatter

# Notebook / data workflow
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# Lint / formatting
charliermarsh.ruff

# AI assistants (optional but useful in DS workflows)
openai.chatgpt
