catppuccin.catppuccin-vsc
pkief.material-icon-theme
drcika.apc-extension
johnpapa.vscode-peacock
leodevbro.blockman
oderwat.indent-rainbow
usernamehw.errorlens
aaron-bond.better-comments
adpyke.codesnap
alefragnani.bookmarks
alefragnani.project-manager
christian-kohler.path-intellisense
ciantic.keymapceditor-vsc
formulahendry.code-runner
natqe.reload
silesky.toggle-boolean
sleistner.vscode-fileutils
vscodevim.vim
arturock.gitstash
donjayamanne.githistory
eamodio.gitlens
github.vscode-github-actions
github.vscode-pull-request-github
mhutchie.git-graph
michaelcurrin.auto-commit-msg
ms-vsliveshare.vsliveshare
waderyan.gitblame
arrterian.nix-env-selector
bbenoist.nix
jnoortheen.nix-ide
anthropic.claude-code
codeium.codeium
github.copilot
github.copilot-chat
openai.chatgpt
saoudrizwan.claude-dev
parallelsdesktop.parallels-desktop
