aaron-bond.better-comments
adpyke.codesnap
alefragnani.bookmarks
alefragnani.project-manager
anthropic.claude-code
arrterian.nix-env-selector
arturock.gitstash
bbenoist.nix
catppuccin.catppuccin-vsc
christian-kohler.path-intellisense
ciantic.keymapceditor-vsc
codeium.codeium
donjayamanne.githistory
drcika.apc-extension
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-complete-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
github.copilot
github.copilot-chat
github.vscode-pull-request-github
humao.rest-client
jnoortheen.nix-ide
johnpapa.vscode-peacock
kamikillerto.vscode-colorize
leodevbro.blockman
lokalise.i18n-ally
mhutchie.git-graph
michaelcurrin.auto-commit-msg
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vsliveshare.vsliveshare
natqe.reload
oderwat.indent-rainbow
parallelsdesktop.parallels-desktop
pkief.material-icon-theme
postman.postman-for-vscode
ritwickdey.liveserver
saoudrizwan.claude-dev
shd101wyy.markdown-preview-enhanced
silesky.toggle-boolean
sleistner.vscode-fileutils
steoates.autoimport
streetsidesoftware.code-spell-checker
usernamehw.errorlens
vintharas.learn-vim
vscodevim.vim
waderyan.gitblame
wallabyjs.console-ninja
wallabyjs.quokka-vscode