# Writing / docs
james-yu.latex-workshop
jeandeaual.lilypond-formatter
jeandeaual.lilypond-syntax
jeandeaual.scheme
lhl2617.lilypond-pdf-preview
lhl2617.lilypond-snippets
lhl2617.vslilypond
marp-team.marp-vscode
myriad-dreamin.tinymist
rickaym.manim-sideview
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
