# Web / frontend
astro-build.astro-vscode
bradlc.vscode-tailwindcss
dbaeumer.vscode-eslint
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-complete-tag
formulahendry.auto-rename-tag
gonishiduka1985.extractioncssselector
humao.rest-client
kamikillerto.vscode-colorize
lokalise.i18n-ally
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
openai.chatgpt
orta.vscode-twoslash-queries
postman.postman-for-vscode
ritwickdey.liveserver
rodrigovallades.es7-react-js-snippets
steoates.autoimport
stivo.tailwind-fold
vue.volar
wallabyjs.console-ninja
wallabyjs.quokka-vscode
wix.vscode-import-cost
yusukehirao.vscode-markuplint
yoavbls.pretty-ts-errors
